Agat/src/InformationRegisters/РегистрУдаленияФайлов/РегистрУдаленияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрУдаленияФайлов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеПоле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьАрхива</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

Agat/src/CommonModules/РаботаСФайламиСервер/Module.bsl
// Настраивает иконки "внутри" строк таблиц
// Настраивает иконки "в ячейках" каждой строки
// Настраивает иконки в ячейках для всех таблиц
// Общий модуль: РаботаСФайламиСервер (Сервер)
///////////////////////////////////////////////////////////////////////////////////////

// Оформление кнопок Приложение / Удалить
Процедура НастроитьОформлениеВсехТаблиц(Форма, МассивИменТЧ) Экспорт
    УО = Форма.УсловноеОформление;
    Для Каждого ИмяТЧ Из МассивИменТЧ Цикл
        
        // Оформляем только ЯЧЕЙКИ в строках (Поля ИмяТЧ+"Действие" и ИмяТЧ+"Удалить")
        // НЕ ДОБАВЛЯЙТЕ сюда элементы командной панели!
        
        // Лупа
        Элемент = УО.Элементы.Добавить();
        Элемент.Оформление.УстановитьЗначениеПараметра("Картинка", БиблиотекаКартинок.картинка_2);
        Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".РасширениеФайла");
        Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
        Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Действие");

        // Крестик
        Элемент = УО.Элементы.Добавить();
        Элемент.Оформление.УстановитьЗначениеПараметра("Картинка", БиблиотекаКартинок.картинка_3);
        Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".РасширениеФайла");
        Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
        Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Удалить");
    КонецЦикла;
КонецПроцедуры
// Получить путь хранилища из константы
Функция ПолучитьПутьХранилища() Экспорт
	Возврат Константы.ПутьХранилищаФайлов.Получить();
КонецФункции

// Код команд // Приложение / Удалить
///////////////////////////////////////////////////////////////////////////////////////
Функция ПроверитьПутьХранилища() Экспорт
    Путь = ПолучитьПутьХранилища();
    Если ПустаяСтрока(Путь) Тогда
        Возврат "Путь пуст!";
    КонецЕсли;
    
    Каталог = Новый Файл(Путь);
    Если Каталог.Существует() Тогда
        Возврат "Путь существует: " + Путь;
    Иначе
        Возврат "Путь НЕ существует: " + Путь;
    КонецЕсли;
КонецФункции

// Сохранение файла из временного хранилища
Функция СохранитьФайлИзВременногоХранилища(АдресВременногоХранилища, УникальныйИдентификатор, РасширениеФайла) Экспорт
    
    Попытка
        ПутьХранилища = ПолучитьПутьХранилища();
        
        // Получаем данные из временного хранилища (уже ДвоичныеДанные)
        ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
        
        Если ДанныеФайла = Неопределено Тогда
            Возврат Ложь;
        КонецЕсли;
        
        // Формируем путь для сохранения
        Назначение = СтрШаблон("%1\%2%3", ПутьХранилища, Строка(УникальныйИдентификатор), РасширениеФайла);
        
        // Создаем каталог, если его нет
        Каталог = Новый Файл(ПутьХранилища);
        Если НЕ Каталог.Существует() Тогда
            СоздатьКаталог(ПутьХранилища);
        КонецЕсли;
        
        // Сохраняем файл - НЕ нужно создавать новый ДвоичныеДанные!
        ДанныеФайла.Записать(Назначение);
        
        Возврат Истина;
        
    Исключение
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции


// Получение файла из хранилища во временное хранилище
Функция ПолучитьФайлИзХранилища(УникальныйИдентификатор, РасширениеФайла) Экспорт
    
    Попытка
        ПутьХранилища = ПолучитьПутьХранилища();
        Источник = СтрШаблон("%1\%2%3", ПутьХранилища, Строка(УникальныйИдентификатор), РасширениеФайла);
        
        ФайлОбъект = Новый Файл(Источник);
        Если НЕ ФайлОбъект.Существует() Тогда
            Возврат "";
        КонецЕсли;
        
        ДвоичныеДанные = Новый ДвоичныеДанные(Источник);
        АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
        
        Возврат АдресВременногоХранилища;
        
    Исключение
        Возврат "";
    КонецПопытки;
    
КонецФункции

// Удаление файла в архив
Функция УдалитьФайлВАрхив(УникальныйИдентификатор, РасширениеФайла, ИмяСправочника = "", НаименованиеЭлемента = "", СсылкаНаОбъект = "", ИмяПользователя = "") Экспорт
    
    Попытка
        ПутьХранилища = ПолучитьПутьХранилища();
        Источник = СтрШаблон("%1\%2%3", ПутьХранилища, Строка(УникальныйИдентификатор), РасширениеФайла);
        
        ФайлОбъект = Новый Файл(Источник);
        Если НЕ ФайлОбъект.Существует() Тогда
            Возврат Ложь;
        КонецЕсли;
        
        ПутьАрхива = СтрШаблон("%1\АрхивУдаленных", ПутьХранилища);
        ИмяФайла = СтрШаблон("%1%2", Строка(УникальныйИдентификатор), РасширениеФайла);
        НазначениеАрхив = СтрШаблон("%1\%2", ПутьАрхива, ИмяФайла);
        
        ПапкаАрхива = Новый Файл(ПутьАрхива);
        Если НЕ ПапкаАрхива.Существует() Тогда 
            СоздатьКаталог(ПутьАрхива); 
        КонецЕсли;
        
        КопироватьФайл(Источник, НазначениеАрхив);
        УдалитьФайлы(Источник);
        
        Возврат Истина;
        
    Исключение
        Возврат Ложь;
    КонецПопытки;
    
КонецФункции

// Запись в регистр удаления (необязательно)
Процедура ЗаписатьВРегистрУдаления(УникальныйИдентификатор, РасширениеФайла, ПутьКФайлу, ПутьАрхива, 
    ИмяСправочника = "", НаименованиеЭлемента = "", СсылкаНаОбъект = "", ИмяПользователя = "") Экспорт
    
    Попытка
        Регистр = Метаданные.РегистрыСведений.Найти("РегистрУдаленияФайлов");
        Если Регистр = Неопределено Тогда
            Возврат;
        КонецЕсли;
        
        Запись = РегистрыСведений.РегистрУдаленияФайлов.СоздатьМенеджерЗаписи();
        Запись.Период = ТекущаяДата();
        Запись.УникальныйИдентификатор = УникальныйИдентификатор;
        Запись.РасширениеФайла = РасширениеФайла;
        Запись.ПутьКФайлу = ПутьКФайлу;
        Запись.ПутьАрхива = ПутьАрхива;
        Запись.ИмяСправочника = ИмяСправочника;
        Запись.КлючевоеПоле = НаименованиеЭлемента;
        Запись.СсылкаНаОбъект = СсылкаНаОбъект;
        Запись.Сотрудник = ИмяПользователя;
        
        Запись.Записать();
        
    Исключение
        // Игнорируем
    КонецПопытки;
    
КонецПроцедуры
///////////////////////////////////////////////////////////////////////////////////////

// Функция получения ссылки по GUID
Функция ПолучитьСсылкуПоГУИД(ИмяСправочника, ГУИД) Экспорт
	
	Попытка
		МетаСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
		Если МетаСправочника = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Ссылка = Справочники[МетаСправочника.Имя].ПолучитьСсылку(ГУИД);
		Возврат Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////
